{
  "basics": {
    "name": "Christopher Reagle",
    "label": "Software Engineer",
    "image": "",
    "email": "chris@chrisreagle.com",
    "phone": "(724) 730-3844",
    "summary": "Software Engineer with 5+ years of experience building scalable, resilient backend systems in high-throughput environments. Currently contributing to McDonald’s global ordering platform, driving performance, reliability, and clean code practices. Passionate about mentoring, architecting scalable systems, and using technology to elevate customer experience in fast-paced, agile environments.",
    "location": {
      "city": "Pittsburgh",
      "countryCode": "US",
      "region": "Pennsylvania"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/creagle"
      }
    ]
  },
  "work": [
    {
      "name": "McDonald's",
      "position": "Software Engineer II",
      "url": "https://corporate.mcdonalds.com/",
      "startDate": "2024-11-12",
      "summary": "Currently a member of the FryKids squad, responsible for backend systems powering ordering across McDonald’s digital platforms. This includes managing the full lifecycle of an order — from initial placement to fulfillment — with a focus on accuracy, reliability, and performance at scale.",
      "highlights": [
        "Supported Performance testing environment, proactively identifying bottlenecks and implementing optimizations that improved reliability",
        "Designed and implemented scalable, modular testing repositories with standardized mocks and folder structures, significantly improving test consistency and enabling faster, and independent testing",
        "Advocated for clean code and test purity, driving adoption of maintainable, well-isolated unit and integration tests across the team to reduce technical debt and improve code quality",
        "Engineered a new interface for restaurant data, abstracting legacy and future business logic into extensible classes, for supporting feature flagging and reducing code duplication",
        "Led the architectural planning and migration to a managed Kafka implementation, improving scalability and maintainability while aligning with global platform standards",
        "Mentored junior engineers by fostering a culture of discovery and ownership, while ensuring delivery of sprint goals and adherence to best practices",
        "Conducted comprehensive code reviews, providing actionable feedback and fostering a team-wide commitment to engineering best practices, clean architecture, and continuous improvement",
        "Created and maintained scripts for existing and newly onboarded engineers to stand up a local testing environment in under 2 minutes",
        "Redesigned and expanded onboarding documentation, enabling new hires to ramp up significantly faster by providing clear guidance, environment setup steps, and project context"
      ]
    },
    {
      "name": "Loyal Health",
      "position": "Software Engineer & Senior Software Engineer (April 2024)",
      "url": "https://loyalhealth.com",
      "startDate": "2021-05-01",
      "endDate": "2024-09-03",
      "summary": "Engineered and maintained scalable chatbot and live chat solutions for healthcare systems, supported CI/CD operations, and led high-impact internal projects. Delivered systems capable of handling 1,000+ messages/second with peak loads of 77,446 messages/hour and up to 500 API requests/second.",
      "highlights": [
        "Developed a patient-facing chat service using ChatGPT and agent-based architecture, incorporating RAG lookups on hospital data.",
        "Collaborated with customer service teams to build tools for bulk importing and custom data migrations, saving hundreds of labor hours per feature.",
        "Redesigned the dialogue management system, reducing onboarding time for new hires by 50% through simplification and a 50+ rule validation engine.",
        "Integrated with third-party APIs including Epic, Cerner, and Infermedica to enable patient data retrieval and symptom-to-diagnosis workflows.",
        "Built intent prediction models using feedforward neural networks and BERT, supported by a local entity library to improve NLU.",
        "Designed and maintained a SignalR-based live chat system supporting real-time P2P and bot communication.",
        "Integrated chatbot services into Google Business Messages (GBM) for improved patient engagement.",
        "Managed distributed microservices on Kubernetes with autoscaling and hot replicas to ensure availability during load spikes.",
        "Developed Kafka consumers for health risk assessment form processing from a centralized service.",
        "Maintained a TensorFlow-based Python service for training custom intent models asynchronously from a queue.",
        "Implemented worker patterns for async operations such as logging and socket cleanup to enhance performance.",
        "Monitored and optimized SQL queries using Azure SQL execution plans, reducing latency across chatbot, reports, and dashboards.",
        "Used Redis as a distributed cache and SignalR backplane, reducing DB load and improving response times.",
        "Achieved full unit and integration test coverage using XUnit, with automated execution in CI pipelines to prevent regressions.",
        "Used Checkly and Playwright to automate SLA monitoring and proactively detect production-impacting issues.",
        "Developed and published a shared UI component library as an NPM package using Rollup.",
        "Built and maintained Azure DevOps pipelines using modular YAML templates for consistent CI/CD processes.",
        "Created a DbUp-powered internal tool for automating database migrations during deployments.",
        "Standardized Kubernetes deployments using Helm charts, improving configuration consistency and speeding up setup.",
        "Published versioned Docker images to a container registry for multi-environment deployments.",
        "Contributed to Agile ceremonies and iterative development in a collaborative engineering team."
      ]
    },
    {
      "name": "Sierra Experts",
      "position": "Software Engineer",
      "url": "https://sierraexperts.com",
      "startDate": "2019-10-01",
      "endDate": "2021-05-01",
      "summary": "Delivered full-stack software solutions and technical expertise across a diverse range of client industries and applications.",
      "highlights": [
        "Independently designed and developed a custom ERP system, collaborating directly with the client to gather requirements and deliver solutions supporting daily business operations.",
        "Built a robust ETL pipeline to consolidate and migrate data from multiple large-scale databases, implementing distributed architecture using merge replication.",
        "Maintained and enhanced an internal backup system deployed on Windows Server, ensuring system reliability and operational continuity.",
        "Provided ongoing maintenance and support for a range of legacy and modern client applications, ensuring stability and performance."
      ]
    },
    {
      "name": "Flowline",
      "position": "System Administrator",
      "startDate": "2018-11-01",
      "endDate": "2019-10-01"
    },
    {
      "name": "Custom Artificial Limb & Brace, Inc",
      "position": "Prosthetist & Orthotist",
      "startDate": "2013-08-01",
      "endDate": "2017-09-01"
    }
  ],
  "education": [
    {
      "institution": "Northwestern University",
      "url": "https://www.northwestern.edu/",
      "area": "Orthotics and Prosthetics",
      "studyType": "Certificate"
    },
    {
      "institution": "University of Pittsburgh",
      "url": "https://pitt.edu/",
      "area": "Business Management and Economics",
      "studyType": "Bachelor of Science"
    }
  ],
  "skills": [
    {
      "name": "Backend Development",
      "keywords": [
        "C#",
        "Python",
        ".NET",
        "Redis",
        "SQL",
        "ChatGPT",
        "NLP",
        "LLM",
        "DynamoDB"
      ]
    },
    {
      "name": "Frontend Development",
      "keywords": [
        "HTML",
        "JavaScript",
        "TypeScript",
        "CSS"
      ]
    },
    {
      "name": "Cloud & Infrastructure",
      "keywords": [
        "Azure",
        "AWS",
        "Kubernetes",
        "Helm",
        "Docker",
        "CI/CD",
        "Kafka"
      ]
    },
    {
      "name": "Testing & QA",
      "keywords": [
        "XUnit",
        "NUnit",
        "Playwright",
        "Checkly",
        "Mocking",
        "Integration Tests",
        "Unit Tests"
      ]
    }
  ],
  "meta": {
    "theme": "jsonresume-theme-even"
  }
}
